app/controllers/audio_files_controller.rb

  def index

    cond = index_conditions(params)

    respond_to do |format|
      format.html do
        # @posts = Post.paginate_by_board_id @board.id, :page => params[:page], :order => 'updated_at DESC'
        @audio_files = AudioFile.paginate :page => params[:page], :order => 'audio_file_style_id, audio_file_type_id, user_id, path', :conditions => cond
---
SELECT * FROM "incoming_audio_files" LIMIT 1

  def edit
    @audio_file = AudioFile.find(params[:id])
---
SELECT * FROM "audio_files" WHERE ("audio_files"."id" = 1)

  def update
    @audio_file = AudioFile.find(params[:id])
    if @audio_file.update_attributes(params[:audio_file])
---
SELECT * FROM "audio_files" WHERE ("audio_files"."id" = 1)
UPDATE "audio_files" SET "updated_at" = '2009-12-03 17:47:49', "audio_file_style_id" = 4 WHERE "id" = 5

  def destroy
    @audio_file = AudioFile.find(params[:id])
    if File.writable?(@audio_file.path)
      #FIXME security
      path = @audio_file.path.gsub(/;|&/, '').gsub('..','')
      `rm "#{path}"`
      @audio_file.destroy
---
SELECT * FROM "audio_files" WHERE ("audio_files"."id" = 3)
DELETE FROM "audio_files" WHERE "id" = 3

  def show
    @audio_file = AudioFile.find(params[:id])
---
SELECT * FROM "audio_files" WHERE ("audio_files"."id" = 1)