app/controllers/audio_file_styles_controller.rb

SELECT * FROM "audio_file_styles"
---
  def index
    @audio_file_styles = AudioFileStyle.all

SELECT * FROM "audio_file_styles" WHERE ("audio_file_styles"."id" = 1)
---
  def show
    @audio_file_style = AudioFileStyle.find(params[:id])

INSERT INTO "audio_file_styles" ("name", "created_at", "updated_at", "metric", "desc") VALUES('xp-idm', '2009-12-03 17:47:35', '2009-12-03 17:47:35', 0.0, '')
---
  def create
    @audio_file_style = AudioFileStyle.new(params[:audio_file_style])
    if @audio_file_style.save

SELECT * FROM "audio_file_styles" WHERE ("audio_file_styles"."id" = 1)
---
  def edit
    @audio_file_style = AudioFileStyle.find(params[:id])

SELECT * FROM "audio_file_styles" WHERE ("audio_file_styles"."id" = 2)
UPDATE "audio_file_styles" SET "updated_at" = '2009-12-03 17:46:59', "desc" = '', "metric" = 0.0 WHERE "id" = 2
---
  def update
    @audio_file_style = AudioFileStyle.find(params[:id])
    if @audio_file_style.update_attributes(params[:audio_file_style])