app/controllers/incoming_audio_files_controller.rb

  def index
    @incoming_audio_files = IncomingAudioFile.all
---
SELECT * FROM "incoming_audio_files"

  def destroy
    @incoming_audio_file = IncomingAudioFile.find(params[:id])
    @incoming_audio_file.destroy
---
SELECT * FROM "incoming_audio_files" WHERE ("incoming_audio_files"."id" = 13)
DELETE FROM "incoming_audio_files" WHERE "id" = 13