app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("created_at", "crypted_password", "profile", "updated_at", "username", "password_salt", "persistence_token", "phone", "email") VALUES('2009-12-03 18:18:11', '0d332a1edfbb711eea50a69fd85367ed4e4d22909c5903ff5cbe94a1eea815873cebd6a417de79966450cd6ae17b36dea78287411c3d05ae757e3d5b5a540b63', '', '2009-12-03 18:18:11', 'test', 'PpDk-2Cq0HHE7Ni-T3Mp', '050bbc69821556228c4e1f8f2df824ff3e837de363ffd0d352676b62b82473ec4affcb0fac8c5ff9d6996a7ab7d0b5e48e52c3e74b072a4eed6708767aa43d10', '', 'test@test.com')

  def edit
    if params[:id] == 'current' or !params[:id]
      @user = current_user
    else
      @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1

  def update
    params[:user][:role_ids] ||= []

    if params[:id] == 'current'
      @user = current_user
    elsif params[:id]
      @user = User.find(params[:id])
    end

    if params[:ftp] && params[:ftp][:create]
      create_ftp_account
    end
    if @user.update_attributes(params[:user])
---
SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1
UPDATE "users" SET "updated_at" = '2009-12-03 18:33:53', "profile" = 'Je suis un super user de test de la mort!' WHERE "id" = 1